using System;
//разработать неизменяемый массив

//нужно поместить файл с именем метода, содержащий таблицу метода в директорию с приложением и запустить
//в файле может содержаться таблица любого другого s-стадийного ЯМРК вместе с числом стадий и порядка
//при желании можно изменить условия системы уравнений, но система должна быть первого порядка,
//все начальные условия должны быть заданы

namespace LagrangeProblem
{
    class Program
    {
        static void Main()
        {
            //_2_18.Solve();
            //_2_19.Solve();
            //_2_2.Solve();
            //_2_4.Solve();
            //_2_9.Solve();
            //_2_15.Solve();
            //MyProblem3.Solve();
            QazanfarsProblem.Solve();

            Console.ReadKey();
        }
    }
}
